tutorials/fluidSolidInteraction/microBeamInCrossFlow/system/solid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1e-3;

pointSync false;

patchInfo
(
    {
        name back;
        dictionary
        {
            type empty;
        }
        constructFrom patches;
        patches ("backPlane");
    }
    {
        name front;
        dictionary
        {
            type empty;
        }
        constructFrom patches;
        patches ("frontPlane");
    }
);

// ************************************************************************* //
